In [13]:
import requests
import urllib
import json
import multiprocessing as mp
import pandas as pd
from lxml import etree
from io import BytesIO


def get_data(number):
    url = "http://www.marocloto.com/keno/tirage.php?draw="+str(number)
    req = urllib.request.Request(url)
    response = urllib.request.urlopen(req)
    webContent = response.read().decode('utf-8')
    return webContent

In [72]:
all_data = []
for i in range(356568,356668):#143255,):
    data = get_data(i)
    all_data = all_data + [x[0:2] for x in data.split('<p class="nextdrawcounterX">')[1:]]

In [74]:
df = pd.DataFrame()
df['values'] = all_data
df['number'] = 0

In [75]:
df.groupby('values').count().sort_values('number', ascending = False).head(5)

        number
values
40          36
51          34
59          34
28          33
01          33

In [66]:
df.groupby('values').count().sort_values('number', ascending = False).head(5)

        number
values
75          35
54          33
55          33
71          32
80          31

In [67]:
df.groupby('values').count().sort_values('number', ascending = False).tail(5)

        number
values
14          18
77          18
46          17
08          15
24          15

In [68]:
all_data = []
for i in range(143255,144255):#356668):
    data = get_data(i)
    all_data = all_data + [x[0:2] for x in data.split('<p class="nextdrawcounterX">')[1:]]
    
df = pd.DataFrame()
df['values'] = all_data
df['number'] = 0

In [69]:
df.groupby('values').count().sort_values('number', ascending = False).head(5)

        number
values
32         279
19         275
54         273
36         273
27         272

In [70]:
df.groupby('values').count().sort_values('number', ascending = False).tail(5)

        number
values
38         230
07         229
52         226
61         226
53         225

In [ ]:
all_data = []
for i in range(143255,143255):#356668):
    data = get_data(i)
    all_data = all_data + [x[0:2] for x in data.split('<p class="nextdrawcounterX">')[1:]]
    
df = pd.DataFrame()
df['values'] = all_data
df['number'] = 0